Revit 2027 API
ExternalDataManagerCommand.SupportMultiItems Property
 Indicates if the command support manipulate multiple items in one execution.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SupportMultiItems { get; set; }
Public Property SupportMultiItems As Boolean
	Get
	Set
public:
property bool SupportMultiItems {
	bool get ();
	void set (bool value);
}
member SupportMultiItems : bool with get, set
Property Value
Boolean
Remarks
 The default value is false.
See Also
Reference
ExternalDataManagerCommand Class
Autodesk.Revit.UI Namespace